Revit 2027 API
Edge.EvaluateOnFace Method
Evaluates a parameter on the edge to produce UV coordinates on the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV EvaluateOnFace(
	double param,
	Face face
)
Public Function EvaluateOnFace (
	param As Double,
	face As Face
) As UV
public:
UV^ EvaluateOnFace(
	double param,
	Face^ face
)
member EvaluateOnFace :
        param : float *
        face : Face -> UV
Parameters
param Double
The parameter to be evaluated, in [0,1].
face Face
The face on which to perform the evaluation. Must belong to the edge.
Return Value
UV
See Also
Reference
Edge Class
Autodesk.Revit.DB Namespace